"""Задача 14:
Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.

Например:
Input:
10
Output:
1 2 4 8
"""


def main() -> None:
    """ Главная функция
    Программа выводит все степени двойки до N включительно. Доступно 3 перегрузки:

    - input: STOP – 'stop' -> N.
    - input: START, STOP - 'START' -> начальная степень 2, а 'STOP' –> последняя степень 2.
    - input: START, STOP, STEP - 'START' -> начальная степень 2, а 'STOP' –> последняя степень 2, 'STEP' -> это шаг.

    :return: None
    """
    pass


if __name__ == '__main__':
    main()
